import { Validator } from "../lib";

describe("validator", () => {

    it('isMobilePhone', () => {
        // 中国电信号段 133、149、153、173、177、180、181、189、191、199、193
        // 中国联通号段 130、131、132、145、155、156、166、171、175、176、185、186
        // 中国移动号段 134(0-8)、135、136、137、138、139、147、150、151、152、157、158、159、172、178、182、183、184、187、188、198
        // 中国广电号段 192
        // 14号段部分为上网卡专属号段：中国联通145，中国移动147，中国电信149.
        const suffix = '12345678'
        const prefixs = [
            133, 149, 153, 173, 177, 180, 181, 189, 191, 199, 193,
            130, 131, 132, 145, 155, 156, 166, 171, 175, 176, 185, 186,
            134, 135, 136, 137, 138, 139, 147, 150, 151, 152, 157, 158, 159, 172, 178, 182, 183, 184, 187, 188, 198,
            192,
            145, 147, 149
        ]
        for (let i = 0; i < prefixs.length; i++) {
            const pre = prefixs[i];
            const phone = pre + suffix
            const bool = Validator.isMobilePhone(phone)
            expect(bool).toBe(true)
        }
    })
})